Revit 2024 API
BuiltInFailures.AnalyticalModelFailures.AutoDetectIgnoreLeaderWarning Property
 Analytical Model for Structural Element has reset to its default location.
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)
Syntax
C#
public static FailureDefinitionId AutoDetectIgnoreLeaderWarning { get; }
Visual Basic
Public Shared ReadOnly Property AutoDetectIgnoreLeaderWarning As FailureDefinitionId
	Get
Visual C++
public:
static property FailureDefinitionId^ AutoDetectIgnoreLeaderWarning {
	FailureDefinitionId^ get ();
}
See Also
BuiltInFailures.AnalyticalModelFailures Class
Autodesk.Revit.DB Namespace